= O
C C
N C
C O
c c
CC C
CC CC
cc c
CC N
C CCN
C N
C NC
ccc c
cccc c
N )
( N)
=O )
( =O)
C (=O)
C(=O) N
O )
( C
(C )
C (C)
C(C) C
CC (=O)
C(=O) O
C(=O) C
C (N)
CC (N)
C(N) =O
CO )
( CO)
CC (C)
C S
= N
CCN C
NC (=O)
=N )
( =N)
C (=N)
CC =O
CCCN )
( CCCN)
N C(=N)
Br )
( Br)
F )
( F)
S )
( S)
C )
O )
( O)
C S
CC S
CCC S
CCS C
c n
cc n
ccc n
CS C
= C
CC O
( C
( O
( =N
C (=N
c (O)
O C
S CC
ccc (F)
S (=O)
O =C
CC c
OC (=O)
C #
C c
C =C
C =
# N
C #N
cc s
N O
C (O)
cs c
ccc (C)
cc (Br)
nc n
CC NO
CCC O
CS S
CSS C
=C C
I )
( I)
C NO
( C)
N (C)
N(C) C
C(N) N
N OC
C(C) =O
# C
cc o
N S
S N
c(=O) n
=S )
( =S)
c(N) c
N =C
S C
S SC
CCC (C)
c (=O)
C#N )
( C#N)
S S
= S
o c
c o
n o
N #
N# C
n c
s c
C(=N) N
C =O
c (F)
C (F)
c (I)
C (I)
cn n
cc (N)
NC (N)
O C
OC )
( OC)
c (OC)
c (Br)
C (N)
cc (O)
CS )
( CS)
O c
cn c
Cl )
( Cl)
c (Cl)
c(O) c
N CC
C OC
O CC
N c
n cc
cc (C)
n n
c s
c(C) c
CO c
C(=O) c
c (C)
(C C)
NC c
nn c
C(O) C
=C (N)
C= CC
=C(N) N
N=C (N)
OC c
C C=C
C Cl
CC n
CN c
CC (O)
N N
CS c
NC (C)
CS (=O)
C (CC)
C# C
C(C) N
CCO )
( CCO)
CN =C
n (C)
n(C) c
c (CO)
#C c
=N C